# author: Ziming Guo
# time: 2020/2/5
'''
        day01_07 复习
        语句
            选择语句（做1次）
                if 条件（bool类型）:
                    pass（如果没想好用啥条件就pass）
                         if里面必须有条件
                else:
                    不满足条件执行的语句
                # 以上条件没有互斥性！（多选）

                if 条件1：
                    满足1执行的语句
                elif 条件2：
                    不满足条件1，满足条件2执行的语句
                elif 条件3：
                    不满足条件1 & 2，满足条件3执行的语句
                else：
                    以上条件都不满足执行的语句
                # 以上代码是有互斥性的！（单选）

            循环语句（一直执行）
                while 条件：
                    满足条件才执行的循环体
                else：
                    不满足条件才执行的语句

            跳转语句
                break
'''